# Используйте официальный образ OpenJDK (замените 17 на вашу версию, если другая)
FROM openjdk:21-jdk-slim

# Аргумент для JAR-файла (можно изменить название)
ARG JAR_FILE=build/libs/masik.jar

# Рабочая директория
WORKDIR /app

# Копируем jar-файл сборки в контейнер
COPY ${JAR_FILE} app.jar

# Открываем порт 8080 (замените, если используется другой)
EXPOSE 8080

# Передаём переменные окружения при запуске (Spring Boot и Ktor читают их автоматически)
# Запуск приложения
ENTRYPOINT ["java","-jar","app.jar"]
